Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། ལོ་བརྒྱར་བསགས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་འདོར་བ་དང་།
en: (11) They forsake the aggregate of discipline, accumulated over a hundred years, to ripen beings.

source: ཆོས་འཛིན་དུ་གཞུག་པའི་ཕྱིར། སེམས་ཅན་རྣམས་ལ་དགའ་བ་དང་། ཐམས་ཅད་ལ་རྩེ་བ་དང་། ལོངས་སྤྱོད་སྟོན་པ་དང་། དེ་ལ་མོས་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། གཡོན་ཅན་མ་རུངས་པས་འཚོ་བའི་ལུས་སུ་སྟོན་པ་དང་།
en: (12) They display all forms of pleasure, delight, and enjoyment to cause others to adopt the Dharma. (13) They assume the physical forms of beings earning their livelihood through unsuitable and crooked means to ripen beings who have such propensities.

source: བུད་མེད་གང་ཚོང་དཔོན་དང་། ཁྱིམ་བདག་དང་། རྒྱལ་པོའི་ཆུང་མར་གྱུར་པ་བུ་མེད་པ་བུའི་ཚེ་འདོད་པའི་མྱ་ངན་གྱི་ཟུག་རྔུ་དང་ལྡན་ཞིང་། སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བ་ལ་དེ་ན་བྱང་ཆུབ་སེམས་དཔས་དེ་དག་དགེ་བ་ལ་དད་ཅིང་། ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དེའི་བུར་ཁས་ལེན་པ་དང་།
en: (14) When the wives of merchants, householders, or kings have no children and experience the painful torment and suffering of wanting a child, the bodhisattvas accept being born as their child in order to cause them to develop faith in virtue and to ripen them.

source: འབྲོག་དགོན་པར་སོང་བའི་སེམས་ཅན་དབུལ་པོ་ལ་བཟའ་བ་དང་། བཏུང་བ་དང་། ནོར་སྦྱིན་ཞིང་བགོ་བཤའ་བྱ་བའི་ཕྱིར་འགྲོན་པོ་མང་པོའི་ནང་དུ་དེད་དཔོན་དུ་འགྱུར་བ་དང་། གཏེར་ཆེན་པོ་མདུན་དུ་བྱས་ཏེ་ནོར་གྱི་ཕུང་པོ་ཆེན་པོ་བྱིན་ནས་ ཆོས་སྟོན་པ་དང་།
en: (15) In order to distribute food, beverages, wealth, and other goods to destitute beings wandering in the wilderness, they manifest as merchants leading many travelers, place great treasures in front of them, and teach them the Dharma after having offered them vast amounts of wealth.

source: མྱ་ངན་གྱི་ཟུག་རྔུ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ཀྱི་མྱ་ངན་གྱི་ཟུག་རྔུ་བསལ་ནསརྫུ་འཕྲུལ་གྱིས་ཆོས་སྟོན་པ་དང་།
en: (16) They eliminate the torments of those who experience the pain of suffering before teaching them the Dharma through their miraculous powers .

source: གཏེར་སྟོར་བའི་སེམས་ཅན་རྣམས་ཀྱི་མདུན་དུ་གཏེར་ཆེན་པོ་ཉེ་བར་བསྟན་ནས་འཚོ་བ་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་པ་དང་།
en: (17) They manifest great treasures in front of those who have lost their wealth before teaching them the Dharma to purify their livelihood.

source: དེ་དག་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་འཇུག་པའི་ཕྱིར་གཞན་མུ་སྟེགས་ཅན་སྤྱོད་པ་ཅན་དང་། ཀུན་ཏུ་རྒྱུ་བ་རྣམས་ཀྱི་ནང་དུ་རབ་ཏུ་འབྱུང་བ་དང་།
en: (18) They manifest as renunciates among the non-Buddhist carakas and parivrājakas to make them adopt the teachings of the Buddha.

source: སེམས་ཅན་འདོད་ཆགས་ཀྱི་ལྕགས་ཀྱུས་ཟིན་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྨད་འཚོང་མའི་ཁྱིམ་དང་། སླས་ཀྱི་ནང་དུ་བུ་མོའི་གཟུགས་མཛེས་པ་བལྟ་ན་སྡུག་པར་སྟོན་པ་དང་།
en: (19) They appear within brothels or harems where they display attractive female bodies to ripen those who are caught by the hook of lust.

source: !སེམས་ཅན་རྣམས་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཀྱིས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འདུས་པ་ཆེན་པོ་དང་། ཚོགས་པ་མང་པོའི་ནང་དུ་རྔ་དང་། རྔ་མྲི་དང་ག་དང་རྔ་པ་ན་བ་དང་དུང་གི་སྒྲས་ས་ཆེན་པོ་མཛེས་པར་བྱས་ནསབདག་ཉེ་བར་སྟོན་ཅིང་སེམས་ཅན་འདུན་པ་དེ་དག་ལ་རོལ་མོའི་དབྱངས་སྒྲ་དེ་དག་ལས་ཆོས་སྟོན་པའི་སྒྲ་འབྱིན་ཅིང་བཟོའི་གནས་ཐམས་ཅད་ཉེ་བར་སྟོན་པ་དང་།
en: (20) To ripen others with the Dharma in accordance with their individual inclinations, they manifest within great gatherings and large groups where they beautify whole areas with the music of their drums, kettle drums, flutes, and conch shells; they then display various crafts within those gatherings and teach others the Dharma through the sounds of those musical tunes.

source: མྱ་ངན་དུ་སོན་པའི་འགྲོན་པ་བཟའ་བ་དང་། བཏུང་བ་ཟད་པ་ལ་མངོན་པར་ཤེས་པ་ཆེན་པོས་རྣམ་པར་རྩེ་ཞིང་དེའི་སྟོབས་ཀྱིས་བཟའ་བ་དང་། བཏུང་བ་བྱིན་ནས་བཀྲེས་པ་དང་བྲལ་ཞིང་སྐོམ་པ་དང་བྲལ་བའི་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་དང་།
en: (21) Through the power of their higher perceptions and out of great love, they offer food and beverages to travelers who suffer from a lack of food and beverages; then they teach them the Dharma once they are relieved from hunger and thirst.

source: སེམས་ཅན་གང་དག་དམུས་ལོང་དུ་གྱུར་པ་དེ་དག་གི་ནང་དུ་དམུས་ལོང་ལྟ་བུར་གྱུར་ནསདབུལ་པོ་མིག་མེད་པ་དེ་དག་ལ་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་བཟའ་བ་དང་། བཏུང་བ་འབྱོར་བར་བྱས་ནས། མིག་བྱིན་ཏེ་རང་གི་གཟུགས་བསྟན་ནས། ཇི་ལྟར་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཆོས་སྟོན་པ་དང་།
en: (22) They manifest as blind people among those who are born blind and, through their miraculous powers , they offer food and beverages to such destitute blind people, and cause them to recover their eyesight so that they can see their physical forms; then they teach them the Dharma in a way that they will definitely reach unsurpassed and perfect awakening.

source: རྒྱལ་པོའི་ཁྲི་མོན་དུ་བཅུག་པའི་སྲོག་ཆགས་བརྒྱ་ཕྲག་དུ་མ་གཡོན་ཅན་སྣ་ཚོགས་དང་ལྡན་པ་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། བསམས་བཞིན་དུ་བདག་རྐུན་པོར་སྟོན་ཅིང་དེ་གཡོན་ཅན་ནོ་ཞེས་ཤེས་པར་བྱས་ནསཁྲི་མོན་དུ་བཅུག་པ་དང་དེ་དེར་ཞུགས་ནས་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་བཅིངས་པ་དེ་དག་གི་ལུས་བཀྲུས་ཤིང་བསྐུས་ཏེ། གོས་བཟང་པོ་བསྐོན་ནས་བཟའ་བ་དང་། བཏུང་བས་ལུས་ཚིམ་པར་བྱས་ཏེ། བཅིངས་པ་དམ་པོ་དེ་དག་ལས་བཀྲོལ་ནས་ཇི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་བ་དེ་ལྟ་བུར་ཆོས་སྟོན་པ་དང་།
en: (23) They intentionally manifest as thieves to ripen hundreds of beings who have engaged in various types of evil activities and who have been incarcerated in the royal prisons; when they are identified as rogues, they enter a prison where, through their miraculous powers , they wash and anoint the bodies of the prisoners, dress them in fine clothes, and offer them food and beverages until they are fully satiated; then they release them from their tight shackles and teach them the Dharma in a way that they will definitely reach unsurpassed and perfect awakening.

source: སེམས་ཅན་གང་དག་རྒྱལ་པོས་གསད་པར་བཀྲི་བ་སྲོག་འཆི་བའི་འཇིགས་པའི་ཐོབ་པ་སྡུག་བསྔལ་གྱིས་ཉམ་ཐག་པ་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྫུ་འཕྲུལ་གྱིས་གཞན་དག་ཅིག་སྤྲུལ་ཏེརྫུ་འཕྲུལ་གྱིས་གཤེད་མ་ལ་བཀྲིས་ནས་གསད་པར་འོས་པའི་མི་དེ་དག་བཅིངས་པ་དེ་ལས་བཀྲོལ་ཏེ། འཇིགས་པ་དང་བྲལ་བ་སྲོག་རྙེད་པ་དང་། དབུགས་ཕྱིན་པ་དེ་དག་ལ་ཇི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟ་བུར་ཆོས་སྟོན་པ་དང་།
en: (24) To ripen beings who are led to the place of their execution at the king’s command, and who are tormented by suffering and the fear of dying, bodhisattva great beings miraculously emanate manifestations that free such condemned prisoners who are being led to their execution from their shackles; they then teach the Dharma to those beings who have been relieved from fear and whose lives have just been saved, in a way that they will definitely reach unsurpassed and perfect awakening.

source: ཕྱོགས་གང་ན་དོན་དང་། ནོར་དང་། ཞིང་དང་། ཁྱིམ་གྱི་དངོས་པོ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། དམག་མིའི་ཕྱིར་འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་དང་། མཚང་འདྲུ་བར་གྱུར་པ་དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ཀྱིས་དབུས་སུ་འདུག་ནས་རྫུ་འཕྲུལ་གྱིས་དོན་དང་། ནོར་དང་རིན་པོ་ཆེ་ཡོངས་སུ་བཏང་སྟེདེ་དག་འདུམ་པར་སྦྱོར་རོ། །དེ་དག་དུམ་པར་རིགས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་།
en: (25) Bodhisattva great beings skillfully remain wherever beings are involved in quarrels, disputes, fights, and conflicts about possessions, wealth, fields, household materials, male servants, female servants, workers, or soldiers; through their miraculous powers they settle the conflicts by giving away their possessions, wealth, and precious materials and, once the different parties have been thus reconciled, they cause them to embrace unsurpassed and perfect awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པས་ཡན་ལག་དང་། ཉིང་ལག་ཐམས་ཅད་ཀྱི་དབང་པོ་ཉམས་པ་མེད་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་དབང་པོ་ཉམས་པར་ཡང་སྟོན་པ་དང་།
en: (26) Even though the major and minor parts of bodhisattvas’ bodies are fully functional, they skillfully manifest with impaired abilities, in order to ripen sentient beings.

source: སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྤྱོད་ལམ་ཐམས་ཅད་འཁྲུགས་པར་ཡང་བྱེད་པ་དང་།
en: (27) Even though the bodhisattvas’ conduct is perfect, they manifest all kinds of disturbed forms of conduct to ripen sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པས་གཞན་མུ་སྟེགས་ཅན་སྟོན་པ་དང་། རིང་དུ་གནས་པ་བདུད་ཀྱི་སྤྱོད་ཡུལ་ལ་སྤྱོད་པ་བདུད་ཀྱིས་བྱིན་གྱིས་བརླབས་པའི་མུ་སྟེགས་ཅན་དེ་དག་སངས་རྒྱས་ཀྱི་བསྟན་པ་ལ་དགུག་པའི་ཕྱིར་དེ་དག་གི་མདུན་དུ་དཀོན་མཆོག་གསུམ་གྱི་བསྔགས་པ་བརྗོད་པ་དང་།
en: (28) Bodhisattvas adept in skillful means manifest themselves as non-Buddhists, and to attract non-Buddhists in faraway lands, who live in demonic domains under the influence of demons, to the teachings of the Buddha, they proclaim the praises of the Three Jewels in front of them.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་ལས་ལོག་ནས་བསམས་བཞིན་དུ་འདོད་པའི་ཁམས་སུ་སྐྱེ་སྟེམྱ་ངན་ལས་འདས་པ་འདོད་པ་རྣམས་ལ་སྐྱེ་བའི་སྡུག་བསྔལ་བསྟན་ནས་དབེན་པ་ཐོབ་པ་རྣམས་བླ་མའི་ལམ་བསྒོམ་དུ་གཟུད་པའི་ཕྱིར། མྱ་ངན་ལས་འདས་པ་སྟོན་པ་དང་།
en: (29) To skillfully ripen others, bodhisattvas give up the concentrations, liberations, absorptions, and attainments, and intentionally take rebirth within the desire realm; they describe the suffering of birth to those who wish for nirvāṇa, and they teach about nirvāṇa to cause those who have attained disengagement to cultivate the highest path.

source: སྐྱོན་མེད་པ་ལ་མ་ཞུགས་པ་ལ་མྱ་ངན་ལས་འདས་པར་འགྲོ་བར་འདུན་པ་རྣམས་ཀྱི་མདུན་དུ། བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པ་སངས་རྒྱས་ཀྱི་སྐུ་སྟོན་པ་དང་།
en: (30) Bodhisattvas skillfully display the bodies of buddhas to those who aspire to reach nirvāṇa but who have not yet entered the faultless state.

source: སངས་རྒྱས་ལ་དད་པ་ཐོབ་ཅིང་། སེམས་མཉམ་པར་བཞག་པ་རྣམས་བྱང་ཆུབ་ཀྱི་སེམས་ལེན་དུ་གཟུད་པའི་ཕྱིར། རྐྱེན་འདི་ཤེས་པ་ལ་འཇུག་པ་ཉེ་བར་སྟོན་པ་སྟེ།
en: (31) To cause beings who have faith in the Buddha and whose minds are settled to embrace the mind set on awakening, they teach them how to attain understanding of this conditioning factor.

source: མིའམ་ཅིའི་བདག་པོ་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་ལ་མཁས་པར་རིག་པར་བྱའོ། །
en: Lord of the kiṃnaras, you should know that bodhisattva great beings are skilled in means through those thirty-two features.”

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་ཐབས་ལ་མཁས་པ་ལ་འཇུག་པ་ཡོངས་སུ་དག་པའི་ལེའུ་འདི་བསྟན་པ་ན།
en: When the Blessed One had taught this section on the purity of engaging in the perfections and skill in means,

source: མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་འཁོར་དང་། དེ་མ་ཡིན་པ་གཞན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟའི་སྲོག་ཆགས་དགུ་ཁྲི་བརྒྱད་སྟོང་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ། །
en: the retinue of the kiṃnara king Druma and ninety-eight thousand beings including gods, nāgas, yakṣas, and gandharvas gave rise to the mind set on unsurpassed and perfect awakening.

source: བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་བྱང་ཆུབ་སེམས་དཔའ་ལས་བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་བརྒྱད་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: Among the retinue of the Blessed One, eighteen thousand bodhisattvas reached acceptance of the unborn nature of phenomena.

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་ནི་ཤེས་རབ་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: The kiṃnara king Druma reached the absorption called the lamp of insight.

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་གཏམ་གྱིས་རབ་ཏུ་དགའ་བར་བྱས། ཡང་དག་པར་འཛིན་དུ་བཙུད། གཟེངས་བསྟོད།
en: With this Dharma discourse, the Blessed One had pleased, captivated, and inspired the kiṃnara king Druma.

source: ཡང་དག་པར་བསྟན་པས། ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: Through this instruction, the king became satisfied, cheerful, thrilled, and elated.

source: དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས།
en: With joy and happiness filling his mind,

source: རིན་ཐང་མེད་པའི་རས་བཅོས་མ་ཕྲུགས་གཅིག་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་བོ། །
en: he clothed the Blessed One in a priceless piece of seamless fabric.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཐམས་ཅད་ལ་ཡང་རིན་ཐང་མེད་པའི་གོས་ཀྱིས་སོ་སོར་བཀབ་བོ། །
en: He also clad each member of the saṅgha of bodhisattvas and each member of the saṅgha of hearers with cloths of inestimable value, and

source: གནས་ཐམས་ཅད་ནི་ཡོངས་སུ་ལོངས་སྤྱད་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ལོ། །
en: offered all his dwelling places for the enjoyment of the Blessed One.

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་བུ་བརྒྱད་སྟོང་པོས་རིན་པོ་ཆེའི་པད་མ་བཀོད་པ་དང་། རིན་པོ་ཆེའི་གདུགས་བརྒྱད་སྟོང་དུ་ཚང་བས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བཀབ་སྟེ།
en: Then, eight thousand sons of the kiṃnara king Druma offered shade to the Blessed One with an array of precious lotuses and eight thousand precious parasols.

source: གཏོར་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་མཐུས་དེ་དག་ཐམས་ཅད་འཁོར་གྱི་ཁྱམས་དེར་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་དྲང་ཐད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་དཔག་ཚད་སྟོང་ཙམ་ན། རིན་པོ་ཆེའི་གདུགས་གཅིག་ཏུ་གནས་པར་གྱུར་ཏོ། །
en: In that very moment, through the power of the Buddha, all those parasols merged to form a single precious parasol in the sky, about a thousand leagues above the courtyard, right over the Blessed One’s head.

source: དེ་ནས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་བུ་བརྒྱད་སྟོང་པོས་བཅོམ་ལྡན་འདས་ཀྱི་ཆོ་འཕྲུལ་ཆེན་པོ་འདི་མཐོང་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ།
en: When the eight thousand sons of the kiṃnara king Druma saw this great miraculous display manifested by the Blessed One, they became satisfied, cheerful, thrilled, and elated.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: With joy and happiness filling their minds,

source: ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །དེ་དག་གིས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: they gave rise to the mind set on unsurpassed and perfect awakening with determination and supplicated the Blessed One:

source: བཅོམ་ལྡན་འདས་གང་ཐོས་པས་བདག་ཅག་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཡང་དག་པར་སྒྲུབ་པར་འགྱུར་བ་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བགྱིད་པའི་ཆོས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བདག་ཅག་ལ་བཤད་དུ་གསོལ།
en: “Blessed One, Thus-Gone One, Worthy One, Perfect Buddha, please tell us about the qualities that mature into awakening so that, upon hearing about them, we may accomplish the factors of awakening!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་བུ་དེ་དག་གི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་ཏ་ལ་བདུན་སྲིད་ཀྱི་སྟེང་གི་བར་སྣང་ལ་སྐྱིལ་མོ་ཀྲུང་བཅས་ཏེ་བཞུགས་ནས་
en: Aware of the good motivation of the sons of the kiṃnara king Druma, the Blessed One rose up to a height of seven palm trees and remained seated cross-legged in the air.

source: སྐུ་ལས་འདི་ལྟ་བུའི་འོད་ཕྱུང་སྟེའོད་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: His body shone with light, illuminating this entire great trichiliocosm with a bright light.

source: གང་མིའམ་ཅི་དང་། དྲི་ཟ་དང་། ལྟོ་འཕྱེ་དེ་དག་དང་། འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་དེ་དག་གི་རོལ་མོ་སིལ་སྙན་རྣམ་པ་སྣ་ཚོགས་དེ་དག་ཐམས་ཅད་མ་བརྡུངས་མ་དཀྲོལ་བར་མཛེས་པ་དང་ལྡན་པར་འཁྲོལ་ལོ། །
en: All the various musical instruments of the kiṃnaras, the gandharvas, the mahoragas, and the gods of the desire realm then started to resound with the most delightful music, without anyone playing them.

source: རིའི་རྒྱལ་པོ་སྤོས་ཀྱི་ངད་ལྡང་ན་དྲིའི་ཤིང་དང་མེ་ཏོག་གི་ཤིང་དང་འབྲས་བུའི་ཤིང་ཇི་སྙེད་པ་དེ་དག་ལས་ཀྱང་རོལ་མོ་སིལ་སྙན་གྱི་སྒྲ་བྱུང་ངོ་། །
en: The sound of music also rang out from all the fragrant, flowering, and blooming trees growing on the majestic Mount Gandhamādana.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་ཀྱང་འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱད་སྟོང་བྱུང་ངོ་། །
en: Next, myriads of light rays shone from all the pores of the Blessed One’s skin, and

source: འོད་ཟེར་ཐམས་ཅད་ཀྱི་རྩེ་མོ་ལས་ཀྱང་པད་མ་ཚད་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་དག་བྱུང་ངོ་། །
en: lotus flowers the size of chariot wheels manifested on the tip of each light ray.

source: པད་མའི་སྙིང་པོ་ཐམས་ཅད་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་སྐྱེས་བུ་ཆེན་པོ་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ཏུ་བརྒྱན་པའི་ལུས་དག་གནས་པར་ཀུན་ཏུ་སྣང་ངོ་། །
en: At the heart of each lotus flower bodhisattvas appeared, displaying pure bodies adorned with the thirty-two marks of great beings.

source: སངས་རྒྱས་ཀྱི་མཐུས་རོལ་མོ་སིལ་སྙན་དེ་དག་ལས་ནི་ཡོངས་སུ་འདྲི་བའི་ཚིགས་སུ་བཅད་པ་བྱུང་།
en: Then, through the power of the Buddha, all the musical instruments resounded with questions in the form of verses,

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ནི་སྒྲ་དབྱངས་དང་སྐད་གཅིག་གིས་ཚིགས་སུ་བཅད་ནས་ངེས་པར་ལན་འདེབས་སོ། །
en: each of which was clearly answered by the bodhisattvas, who replied in chorus, also in verse.

source: དེ་ལ་སིལ་སྙན་ལས་ཚིགས་སུ་བཅད་པ།
en: First, the instruments asked:

source: བླ་ན་མེད་པའི་བྱང་ཆུབ་སེམས། །ཇི་ལྟ་བུར་ནི་སྐྱེད་པ་དང་། །བྱང་ཆུབ་སྙིང་པོར་འདུག་བར་དུ། །སེམས་ནི་བརྗེད་པ་མེད་པར་འགྱུར། །
en: “Once the bodhisattvas have engendered The mind set on unsurpassed awakening, How do they avoid forgetting it Until the seat of awakening is reached?”

source: བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་རྣམས་ཀྱིས་སྨྲས་པ།
en: Then, the bodhisattva manifestations replied:

source: སེམས་ཅན་ཀུན་གྱི་ཆེད་ཀྱི་ཕྱིར། །ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས། །སྙིང་རྗེ་ཆེ་དང་ལྡན་པ་ནི། །བྱང་ཆུབ་སེམས་བརྗེད་མི་འགྱུར་རོ། །
en: “They do not forget the mind set on awakening Because they are endowed with great compassion And perfect motivation Directed toward all sentient beings.”

source: སིལ་སྙན་རྣམས་ཀྱིས་སྨྲས་པ།
en: Then, the instruments asked:

source: དེ་དག་བསམ་པ་ཇི་ལྟ་བུ། །
en: “How is their motivation?

source: རབ་ཏུ་འབྱོར་པ་ཅི་འདྲ་ཞིག །
en: How are their actions?

source: དེ་དག་སྙིང་རྗེ་ཆེན་པོ་ལ། །ངེས་པར་སེམས་པ་ཇི་ལྟར་སྐྱེ། །
en: How do they go about cultivating Great compassion?”

source: གཡོ་མེད་ལྷག་པའི་བསམ་པ་སྟེ། །
en: “Their good motivation is unwavering,

source: དེ་དག་སྦྱོར་བ་བཅོས་མ་མིན། །
en: Their actions are uncontrived, And

source: མྱ་ངན་འདའ་སྒོར་འཇོག་པ་ནི། །དེ་དག་སྙིང་རྗེ་པོ་སྡོང་དེ་འདྲའོ། །
en: their compassion is such That it establishes them at the gateway to nirvāṇa.”

source: དེ་དག་གཏོང་བ་ཇི་ལྟ་བུ། །
en: “How is their generosity?

source: ཇི་ལྟར་བྱིན་ནས་འགྱོད་མེད་ཅིང་། །རྣམ་སྨིན་དོན་དུ་མི་གཉེར་བར། །བྱང་ཆུབ་ཏུ་ནི་སྔོ་བར་བྱེད། །
en: How do they give without regret? How do they dedicate their generosity to awakening Without aspiring to any reward?”

source: དངོས་པོ་ཀུན་ལ་མི་ལྟ་བ། །དེས་ནི་བྱིན་ནས་འགྱོད་པ་མེད། །
en: “They have no regard for material things; Thus, they give without regret.

source: བྱང་ཆུབ་ལམ་དུ་འཇོག་བྱེད་པ། །དེ་ཕྱིར་རྣམ་སྨིན་རེ་བ་མེད། །
en: They follow the path of awakening, And thus do not hope for any ripening.”

source: ཇི་ལྟར་ཚུལ་ཁྲིམས་ལྡན་གྱུར་ཀྱང་། །ཚུལ་ཁྲིམས་ཀྱིས་ནི་རློམ་སེམས་མེད། །ཐེག་ཆེན་བླ་ན་མེད་པ་ལ། །ངང་ཚུལ་ངན་ཅན་སྨིན་པར་བྱེད། །
en: “How do they maintain discipline Without thinking about their discipline? How do they ripen those with corrupted discipline Into the unsurpassed Great Vehicle?”

source: བྱང་ཆུབ་སེམས་ཀྱི་ཚུལ་ཁྲིམས་ལྡན། །
en: “They observe the discipline of the mind set on awakening.

source: སྟོང་པ་ཉིད་ཀྱིས་རློམ་སེམས་མེད། །
en: Due to emptiness they are free from concepts.

source: བྱམས་པ་ཆེན་པོ་སྐྱེད་པ་ནི། །ངང་ཚུལ་ངན་ཅན་ཡོངས་སྨིན་བྱེད། །
en: They ripen those with malicious dispositions By generating great love.”

source: ཇི་ལྟར་ན་ནི་སེམས་ཅན་གྱི། །སྤྱོས་ཤིང་བསྡིགས་པ་བཟོད་བྱེད་ཅིང་། །སེམས་ཀྱིས་གནོད་པ་མི་བྱེད་ལ། །མཆོག་ཏུ་དགའ་བ་སྐྱེ་བར་འགྱུར། །
en: “How do they bear the insults And intimidations of sentient beings? How do they not have ill will, But instead, become delighted?”

source: བདག་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །ཉོན་མོངས་གསོ་བའི་སྨན་པ་སྙམ། །
en: Instead, they think, ‘I will be the healer Of all beings’ afflictions!’ ”

source: དེ་དག་ངན་པར་སྨྲས་པ་ཡི། །ཚིག་ཐོས་ཞེ་སྡང་མི་འགྱུར་རོ། །
en: “They do not become angry When they hear others speaking ill of them.

source: དེ་དག་བརྩོན་འགྲུས་ཇི་ལྟ་བུ། །
en: “How is their diligence?

source: ཕ་རོལ་གནོན་པའང་ཅི་འདྲ་ཞིག །
en: How do they subdue their opponents?

source: ཇི་ལྟར་ཞུམ་པ་མེད་སེམས་ཀྱིས། །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པར་འགྱུར། །
en: How do they practice bodhisattva conduct Without being disheartened?”

source: ཆོས་དང་སེམས་ཅན་བསྲུང་བ་ནི། །ཕ་རོལ་གནོན་དང་བརྩོན་འགྲུས་སོ། །
en: “They subdue their opponents and engender diligence By guarding the Dharma and sentient beings.

source: དགེ་བའི་རྩ་བས་བརྟན་པ་ནི། །དེས་ན་སེམས་ནི་ཞུམ་མི་འགྱུར། །
en: They never become disheartened Because they have reached stability through their roots of virtue.”

source: དེ་དག་ཇི་ལྟར་དྲན་དང་ལྡན། །
en: “How are they endowed with mindfulness?

source: བློ་གྲོས་རྟོགས་པར་ཁོང་དུ་ཆུད། །
en: How do they master wisdom?

source: ཇི་ལྟར་བསམ་གཏན་བསམ་གཏན་བྱེད། །དེ་ལ་ཆགས་པ་མེད་པར་འགྱུར། །
en: How are they absorbed in concentration Without being attached to those states?”

source: གཡེང་བ་མེད་པ་དྲན་དང་ལྡན། །
en: “They embody mindfulness through the absence of distraction,

source: ཚུལ་འཆོས་མེད་པ་བློ་གྲོས་ལྡན། །
en: They embody wisdom by remaining free from pretense,

source: ཐབས་ཀྱིས་བསམ་གཏན་བསམ་གཏན་བྱེད། །དེས་ན་དེ་ལ་ཆགས་མི་འགྱུར། །
en: They are skillfully absorbed in concentration, And are therefore not attached to those states.”

source: ཇི་ལྟར་ཤེས་རབ་ལྡན་པ་དང་། །ཡང་དག་ལྟ་བ་དྲང་པོ་དང་། །ཆོས་རྣམས་རྣམ་པར་དབྱེ་བ་ལ། །མཁས་ཤིང་འཇིགས་པ་མེད་པར་འགྱུར། །
en: “How do they embody insight? How do they become skilled and fearless With regard to the right view And the analysis of phenomena?”

source: ཐོས་པས་ཤེས་རབ་ཀུན་ཏུ་འཕེལ། །
en: “Their insight unfolds through learning, And

source: རྟེན་པས་ལྟ་བ་དྲང་པོར་འགྱུར། །
en: the right view is attained on that basis.

source: ཆོས་ཀྱི་སྦྱིན་པས་ངེས་འགྱུར་ཏེ། །ཚུལ་བཞིན་གྱིས་ནི་དོན་རྟོགས་འགྱུར། །
en: Through the gift of the Dharma they gain certainty And proper realization.”

source: ཇི་ལྟར་ཐོས་པ་བཙལ་བས་ན། །དེ་དག་ཐོས་པ་མང་དུ་འགྱུར། །
en: “How do they become erudite By pursuing learning?

source: གང་གིས་ཆེ་བའི་བདག་འགྱུར་བར། །ཐོས་པའི་ཆོས་རྣམས་སྟོན་པར་འགྱུར། །
en: How do they achieve greatness As they teach what they have learned?”

source: གུས་པར་བྱས་ཏེ་ཐོས་ཚོལ་ཞིང་། །སྒྲུབ་པའི་ཐོས་པ་མང་དུ་འགྱུར། །
en: “They gain erudition By pursuing learning with respect.

source: ཟང་ཟིང་མེད་པར་ཆོས་སྦྱིན་པ། །དེས་ནི་ཆེ་བའི་བདག་ཉིད་འགྱུར། །
en: They achieve greatness By offering the Dharma without concern for material things.”

source: དེ་དག་བྱམས་པ་ཇི་ལྟ་བུ། །
en: “How is their love?

source: དེ་དག་སྙིང་རྗེ་ཅི་འདྲ་ཞིག །
en: What is their compassion like?

source: དེ་དག་དགའ་བ་ཇི་ལྟ་བུ། །
en: How is their joy?

source: བཏང་སྙོམས་ཀྱང་ནི་ཅི་འདྲ་ཞིག །
en: What is their equanimity like?”

source: !སེམས་དང་བཏང་སྙོམས་བྱམས་པ་སྟེ། །
en: “Their love is an impartial attitude and outlook,

source: སེམས་ཅན་འགྲོལ་བའི་སྙིང་རྗེའོ། །
en: Their compassion liberates others,

source: སངས་རྒྱས་ཆོས་དགའ་དགའ་བ་སྟེ། །
en: Their joy delights in buddha qualities, And

source: གཉིས་སྤངས་པ་ནི་བཏང་སྙོམས་སོ། །
en: their equanimity abandons duality.”

source: ཇི་ལྟར་སངས་རྒྱས་མཐོང་བར་འགྱུར། །
en: “How do they behold buddhas And

source: !སེམས་ཀྱང་ཇི་ལྟར་མཐོང་བར་འགྱུར། །
en: how do their minds become faithful?

source: ཆོས་ཐོས་ནས་ནི་ཇི་ལྟ་བུར། །དེ་དག་ཐེ་ཚོམ་སྐྱེ་མི་འགྱུར། །
en: How do doubts not arise in them After they hear the Dharma?”

source: སངས་རྒྱས་རྗེས་སུ་དྲན་བསྒོམས་པ། །དེས་ནི་འདྲེན་པ་མཐོང་བར་འགྱུར། །
en: “They behold the guides Because they have cultivated the recollection of the buddhas.

source: ཐེ་ཚོམ་མེད་ཅིང་བསམ་དག་པས། །ཆོས་ཐོས་ནས་ནི་སོམ་ཉི་མེད། །
en: They have no doubts upon hearing the Dharma Because they are free from hesitation and their thoughts are pure.”

source: བསོད་ནམས་ཚོགས་ནི་ཇི་ལྟ་བུ། །
en: “How do they accumulate merit?

source: ཡེ་ཤེས་ཚོགས་ཀྱང་ཅི་འདྲ་ཞིག །
en: How do they accumulate wisdom?

source: དེ་དག་ཞི་གནས་ལྷག་མཐོང་ལ། །བརྩོན་པ་ཡང་ནི་ཇི་ལྟ་བུ། །
en: How do they exert themselves In tranquility and special insight?”

source: ངོམས་མི་ཤེས་པ་བསོད་ནམས་ཚོགས། །
en: “They accumulate merit by being insatiable,

source: འདྲི་བ་རྣམས་ནི་ཡེ་ཤེས་ཚོགས། །
en: They accumulate wisdom through inquiries,

source: ཞི་བའི་སེམས་ནི་ཞི་གནས་ཏེ། །
en: They cultivate tranquility with a peaceful mind, And

source: ཆོས་ཤེས་པ་ནི་ལྷག་མཐོང་ངོ་། །
en: they develop insight by understanding the Dharma.”

source: དེ་དག་གི་ནི་སྤྱོད་ཡུལ་གང་། །
en: “What is their domain?

source: དེ་དག་གནས་ཀྱང་ཇི་ལྟ་བུ། །
en: What is their basis?
